date1 = {'衣服':[10,25.9],'零食':[9,99.4], '化妆品':[3,859.9]}
date2 = {'电子设备':[5,1298.9],'家具':[2,99099], '皮具':[3,3299]}
date3 = {'办公用品':[3,12989],'电脑':[2,4599], '运动鞋':[3,899]}
order_info = {'2020/04/28':date1,'2020/04/29':date2,'2020/04/30':date3}
count_order = 0 # 订单总数
sum_order = 0 # 订单总金额
day = '' # 初始化日期
day_order = {} # 每天的字典变量初始化
for day, day_order in order_info.items():
    print('%s购买记录为'%day)
    for name,sub_order in day_order.items():
        count_order+=sub_order[0]
        sum_order+=sub_order[0]*sub_order[1]
        print('%s 数量%d 单价%.2f'%(name,sub_order[0],sub_order[1]))

print('购买总数量为%d,总金额为%.2f'%(count_order,sum_order))
# 2020/04/28购买记录为
# 衣服 数量10 单价25.90
# 零食 数量9 单价99.40
# 化妆品 数量3 单价859.90
# 2020/04/29购买记录为
# 电子设备 数量5 单价1298.90
# 家具 数量2 单价99099.00
# 皮具 数量3 单价3299.00
# 2020/04/30购买记录为
# 办公用品 数量3 单价12989.00
# 电脑 数量2 单价4599.00
# 运动鞋 数量3 单价899.00
# 购买总数量为40,总金额为269184.80