# 关于列表的几种算法案例
num = 0
sum_money = 0
i = 0
book_list = ['2020/05/01', '我的经验与教训', 70, 5,
             '2020/05/01', '资本论', 45.60, 10,
             '2020/05/02', '百年孤独', 39.90, 12,
             '2020/05/02', '追风筝的人', 30.50, 8,
             '2020/05/03', '人生海海', 40, 5,
             '2020/05/03', '人间失格', 20.80, 5,
             ]
print('-------买书清单------')
while i < len(book_list):
    num = num + book_list[i + 3]
    sum_money = sum_money + book_list[i+2]*book_list[i+3]
    print('%s,%s,%.2f,%d' %
          (book_list[i], book_list[i+1], book_list[i+2], book_list[i+3]))
    i = i+4
print('总数量:%d,总金额:%.2f' % (num, sum_money))
# -------买书清单------
# 2020/05/01,我的经验与教训,70.00,5
# 2020/05/01,资本论,45.60,10
# 2020/05/02,百年孤独,39.90,12
# 2020/05/02,追风筝的人,30.50,8
# 2020/05/03,人生海海,40.00,5
# 2020/05/03,人间失格,20.80,5
# 总数量:45,总金额:1832.80
